name: "inception_v3"
platform: "onnxruntime_onnx"

input [
  {
    name: "x"
    data_type: TYPE_FP32
    # The first dimension is changed from -1 to 1 to match the model.
    dims: [ 1, 3, 299, 299 ]
  }
]

output [
  {
    name: "875"
    data_type: TYPE_FP32
    # The first dimension is changed from -1 to 1 to match the model.
    dims: [ 1, 1000 ]
  }
]