name: "resnet50"
platform: "onnxruntime_onnx"
max_batch_size: 4
input [
  {
    name: "INPUT"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]
default_model_filename: "model.onnx"
